app/Controllers/Evaluations.php

    public function view($id)
    {
        $data = $this->data;

        $this->builder->select('*');
        $this->builder->where($this->pfield, $id);
        $eval = $records = $this->builder->get()->getRow();

        $builder1 = $this->db->table('ballot');
        $builder1->select('*');
        $data['count'] = $builder1->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `ballot`