app/Controllers/Evaluations.php

SELECT *
FROM `evaluations`
WHERE `id` = '3'
---
    public function view($id)
    {
        $this->builder->select('*');
        $this->builder->where($this->pfield, $id);
        $this->data['records'] = $records = $this->builder->get()->getFirstRow();

        $this->data['result'] = array();
        if ($records->status == 0) {
            $facultyQuery = $this->db->table('faculty')
                ->select('ballot.evaluationID, faculty.id, faculty.fname, faculty.mname, faculty.lname, SUM(ballot.rating) AS total_rating')
                ->join('ballot', 'faculty.id = ballot.facultyID', 'left')
                ->where('evaluationID', $records->id)
                ->orderBy('total_rating', 'desc');
            $facultyResults = $facultyQuery->get()->getResult();