app/Controllers/Result.php

SELECT `ballot`.`id`, `ballot`.`evaluationID`, `ballot`.`facultyID`, `ballot`.`studentID`, `ballot`.`questionID`, `ballot`.`subID`, SUM(ballot.rating) as total_rating, `faculty`.*, `evaluations`.`name`, `evaluations`.`desc`, `evaluations`.`id`, `evaluations`.`status` as `eval_stat`
FROM `ballot`
LEFT JOIN `faculty` ON `faculty`.`id` = `ballot`.`facultyID`
LEFT JOIN `evaluations` ON `evaluations`.`id` = `ballot`.`evaluationID`
GROUP BY `ballot`.`facultyID`
ORDER BY `total_rating` DESC
SELECT COUNT(*) AS `numrows`
FROM `ballot`
SELECT COUNT(*) AS `numrows`
FROM `questions`
---
    public function list()
    {
        $data = $this->data;

        $this->builder->select('*');
        $this->builder->where('status', 0);
        $data['count'] = $this->builder->countAllResults();

        $data['result'] = array();
        $builder1 = $this->db->table('ballot');
        $builder1->select('ballot.id');
        $builder1->select('ballot.evaluationID');
        $builder1->select('ballot.facultyID');
        $builder1->select('ballot.studentID');
        $builder1->select('ballot.questionID');
        $builder1->select('ballot.subID');
        $builder1->select('SUM(ballot.rating) as total_rating');
        $builder1->select('faculty.*');
        $builder1->select('evaluations.name, evaluations.desc, evaluations.id, evaluations.status as eval_stat');
        $builder1->join('faculty', 'faculty.id = ballot.facultyID', 'left');
        $builder1->join('evaluations', 'evaluations.id = ballot.evaluationID', 'left');
        $builder1->groupBy('ballot.facultyID');
        $builder1->orderBy('total_rating', 'desc');
        $results = $builder1->get()->getResult();

        $builder3 = $this->table('ballot');
        $data['noStud'] = $builder3->countAllResults();

        $builder3 = $this->table('questions');
        $data['noQues'] = $builder3->countAllResults();