app/Controllers/Studenteval.php

    public function list() {
        $data  = $this->data;
        $controller = service('uri')->getSegment(2);

        $data['sFaculty']   = $this->request->getPost('facultyField');
        $data['sTerm']      = $this->request->getPost('termField');
        $data['sSubject']   = $this->request->getPost('subjectField');
        $data['sYear']      = $this->request->getPost('yearField');

        // ==============================================
        $data['tblFaculty'] = $this->db->table('faculty')->select('fname, lname, id')->get()->getResult();
        $data['tblEval']    = $this->db->table('evaluations')->select('id, name, acadYear, term')->get()->getResult();
        $data['tblSubject'] = $this->db->table('subjects')->select('subID, title')->get()->getResult();
        $data['tblCat']     = $this->db->table('categories')->select('catName, catID')->get()->getResult();
        $data['noCat']      = count($data['tblCat']);

        if (
            isset($data['sFaculty']) && isset($data['sTerm']) &&
            isset($data['sSubject']) && isset($data['sYear'])
        ) {

            $filtered = $this->db->table('ballot')->select('SUM(ballot.rating) as rating, ballot.catID as catID, ballot.studentID as studentID');
            $filtered->join(    'evaluations',             'ballot.evaluationID = evaluations.id', 'right');
            $filtered->where('ballot.facultyID', $data['sFaculty']);
            $filtered->where('evaluations.term', $data['sTerm']);
            $filtered->where('evaluations.acadYear', $data['sYear']);
            $filtered->where('ballot.subID', $data['sSubject']);
            $filtered->groupBy(['ballot.catID', 'ballot.studentID']);
            $filtered->orderBy('ballot.catID, ballot.studentID');
            $data['ratings'] = $filtered->get()->getResult();
---
SELECT `fname`, `lname`, `id`
FROM `faculty`
SELECT `id`, `name`, `acadYear`, `term`
FROM `evaluations`
SELECT `subID`, `title`
FROM `subjects`
SELECT `catName`, `catID`
FROM `categories`
SELECT SUM(ballot.rating) as rating, `ballot`.`catID` as `catID`, `ballot`.`studentID` as `studentID`, COUNT(ballot.studentID) as sCount
FROM `ballot`
RIGHT JOIN `evaluations` ON `ballot`.`evaluationID` = `evaluations`.`id`
WHERE `ballot`.`facultyID` = '84'
AND `evaluations`.`term` = '1'
AND `evaluations`.`acadYear` = '2020'
AND `ballot`.`subID` = '33'
GROUP BY `ballot`.`catID`, `ballot`.`studentID`
ORDER BY `ballot`.`catID`, `ballot`.`studentID`