app/Controllers/Students.php

SELECT *
FROM `students`
---
    public function list()
    {
        $this->builder->select('students.*');
        $this->builder->select('courses.*');

SELECT *
FROM `faculty`
SELECT *
FROM `subjects`
SELECT `blocksections_details`.*, `faculty`.*, `subjects`.*
FROM `blocksections_details`
LEFT JOIN `faculty` ON `blocksections_details`.`facultyID`= `faculty`.`id`
LEFT JOIN `subjects` ON `blocksections_details`.`subID`= `subjects`.`subID`
WHERE `studentID` = '12'
---
    public function view($id)
    {
        $this->builder->select('students.*');
        $this->builder->select('courses.*');
        $this->builder->join('courses', 'courses.courseID = students.courseID', 'left');
        $this->builder->where('students.' . $this->pfield, $id);
        $this->data['records'] = $records = $this->builder->get()->getFirstRow();

        $builder2 = $this->table('faculty');
        $builder2->select('*');
        $builder2->orderBy('faculty.fname', 'asc');
        $this->data['faculty'] = $builder2->get()->getResult();

        $builder2 = $this->table('subjects');
        $builder2->select('*');
        $builder2->orderBy('subjects.subCode', 'asc');
        $this->data['subjects'] = $builder2->get()->getResult();

        $builder2 = $this->table('blocksections_details');
        $builder2->select('blocksections_details.*');
        $builder2->select('faculty.*');
        $builder2->select('subjects.*');
        $builder2->select('evaluations.*');
        $builder2->join('faculty', 'blocksections_details.facultyID= faculty.id', 'left');
        $builder2->join('subjects', 'blocksections_details.subID= subjects.subID', 'left');
        $builder2->join('evaluations', 'blocksections_details.evaluationID= evaluations.id', 'left');
        $builder2->where('studentID', $records->id);