app/Controllers/Studenteval.php

SELECT *
FROM `courses`
ORDER BY `title` ASC
SELECT *
FROM `evaluations`
ORDER BY `name` ASC
SELECT *
FROM `subjects`
ORDER BY `subCode` ASC
SELECT *
FROM `subjects`
WHERE `subID` = '33'
 LIMIT 1
---

        $courses = $this->db->table('courses');
        $courses->orderBy('title', 'asc');
        $data['courses'] = $courses->get()->getResult();

        $evaluations = $this->db->table('evaluations');
        $evaluations->orderBy('name', 'asc');
        $data['evaluations'] = $evaluations->get()->getResult();

        $subjects = $this->db->table('subjects');
        $subjects->orderBy('subCode', 'asc');
        $data['subjects'] = $subjects->get()->getResult();
        $data['subID'] = $subjects->getWhere(['subID' => $subjectID], 1);

SELECT DISTINCT *
FROM `faculty`
ORDER BY `fname` ASC
SELECT *
FROM `courses`
WHERE `courseID` = '1'
---
        $faculty = $this->db->table('faculty');
        $faculty->orderBy('fname', 'asc');
        $faculty->distinct();
        $data['faculty'] = $faculty->get()->getResult();


        $data['getEval']    = $evaluations->where('id', $evaluationID)->get()->getRow();
        $data['getCourse']  = $courses->where('courseID', $courseID)->get()->getRow();