app/Controllers/SummarySem.php

SELECT SUM(ballot.rating) AS sum, `ballot`.`evaluationID` AS `evalID`, COUNT(ballot.rating) as no
FROM `ballot`
JOIN `evaluations` ON `ballot`.`evaluationID` = `evaluations`.`id`
WHERE `facultyID` = '84'
ORDER BY `evaluations`.`id`
---
    public function list() {
        $data['current_page'] = site_url('summarysem');
        $data['module_title'] = 'summarysem';

        $fID = $this->request->getPost('fName');


        $data['selectedID'] = $this->db->table('faculty')->select('id, fname, lname')->where('id', $fID)->get()->getRow();





        $facultyTbl = $this->db->table('faculty');
        $facultyTbl->select('id, fname, lname');
        $facultyTbl->orderBy('lname');
        $fRes = $facultyTbl->get()->getResult();
        $data['fnames'] = $fRes;



        $ballotTbl = $this->db->table('ballot');
        $ballotTbl->select('SUM(ballot.rating) AS sum, ballot.evaluationID AS evalID, COUNT(ballot.rating) as no');
        $ballotTbl->join('evaluations', 'ballot.evaluationID = evaluations.id');
        $ballotTbl->where('facultyID', $fID);
        $ballotTbl->orderBy('evaluations.id');
        $res = $ballotTbl->get()->getResult();