app/Controllers/SummaryInc.php

    public function list() {
        $data['current_page']   = site_url('summaryinc');
        $data['module_title']   = 'summaryinc';


        // =============== Get all data from selection fields ================
        $data['selectedCourse']     = $this->request->getPost('courseField');
        $data['selectedTerm']       = $this->request->getPost('termField');
        $data['selectedProf']       = $this->request->getPost('profField');
        $data['selectedYear']       = $this->request->getPost('acadYearField');



        // ============ Get data from database to fill the form selection ===================
        $data['courseTbl']          = $this->db->table('courses')->select('title, description, courseID')->get()->getResult();
        $data['facultyTbl']         = $this->db->table('faculty')->select('fname, lname, id')->get()->getResult();
        $data['termTbl']            = $this->db->table('evaluations')->select('name, acadYear, term, id')->get()->getResult();
        $data['catTbl']             = $this->db->table('categories')->select('catName, title, catID')->get()->getResult();
---
SELECT `title`, `description`, `courseID`
FROM `courses`
SELECT `fname`, `lname`, `id`
FROM `faculty`
SELECT `name`, `acadYear`, `term`, `id`
FROM `evaluations`
SELECT `catName`, `title`, `catID`
FROM `categories`