app/Controllers/SummarySem.php

    public function list() {
        $data['current_page'] = site_url('summarysem');
        $data['module_title'] = 'summarysem';

        $fID = $this->request->getPost('fName');

        $data['selectedID'] = $this->db->table('faculty')->select('id, fname, lname')->where('id', $fID)->get()->getRow();

        echo ( empty($fID) ) ? 'fuck' : 'shit';

        $facultyTbl = $this->db->table('faculty');
        $facultyTbl->select('id, fname, lname');
        $facultyTbl->orderBy('lname');
        $fRes = $facultyTbl->get()->getResult();
        $data['fnames'] = $fRes;

        $ballotTbl = $this->db->table('ballot');
        $ballotTbl->select('SUM(ballot.rating) AS sum, ballot.evaluationID AS evalID, COUNT(ballot.rating) as no');
        $ballotTbl->join('evaluations', 'ballot.evaluationID = evaluations.id');
        $ballotTbl->orderBy('evaluations.id');
        $res = $ballotTbl->get()->getResult();
        $data['query'] = $res;

        $eval = $this->db->table('evaluations');
        $eval->select('name, id');
        $eval->orderBy('evalOrder');
        $resEval = $eval->get()->getResult();
---
SELECT `id`, `fname`, `lname`
FROM `faculty`
WHERE `id` = '84'
SELECT `id`, `fname`, `lname`
FROM `faculty`
ORDER BY `lname`
SELECT SUM(ballot.rating) AS sum, `ballot`.`evaluationID` AS `evalID`, COUNT(ballot.rating) as no
FROM `ballot`
JOIN `evaluations` ON `ballot`.`evaluationID` = `evaluations`.`id`
ORDER BY `evaluations`.`id`
SELECT `name`, `id`
FROM `evaluations`
ORDER BY `evalOrder`