app/Controllers/Summary.php

        if ($facultyID) {
            $getFaculty  = $this->db->table('faculty');
            $getFaculty->where('id', $facultyID);
            $recFaculty = $getFaculty->get()->getRow();
---
SELECT *
FROM `faculty`
WHERE `id` = '84'


        $evaluations          = $this->db->table('faculty');
        $evaluations->orderBy('fname', 'asc');
        $data['evaluations'] = $evaluations->get()->getResult();

        $categories          = $this->db->table('categories');
        $data['categories']  = $categories->get()->getResult();
---
SELECT *
FROM `faculty`
ORDER BY `fname` ASC
SELECT *
FROM `categories`